mermaid charts on docs
